Catalogs/Аптеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Аптеки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Код_Аптеки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Адреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_фармацевт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Аптеки/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
    // Поиск существующего пользователя по логину
    Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ЭтотОбъект.Код_Аптеки);

    Если Пользователь = Неопределено Тогда
        // Создание нового пользователя для сотрудника
        НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
        НовыйПользователь.Имя = ЭтотОбъект.Код_Аптеки;
        НовыйПользователь.ПолноеИмя = ЭтотОбъект.ФИО_фармацевт;
        НовыйПользователь.АутентификацияСтандартная = Истина;
        НовыйПользователь.Пароль = "";
        НовыйПользователь.Роли.Добавить(Метаданные.Роли.Фармацевт);
        НовыйПользователь.ПоказыватьВСпискеВыбора = Ложь;
        НовыйПользователь.Язык = Метаданные.Языки.Русский;
        НовыйПользователь.Записать();
        Сообщить("Создан новый пользователь для аптеки.");
    Иначе
        // Обновление ФИО существующего пользователя
        Пользователь.ПолноеИмя = ЭтотОбъект.ФИО_фармацевт;
        Пользователь.Записать();
        Сообщить("Обновлено ФИО существующего пользователя для аптеки.");
    КонецЕсли;
КонецПроцедуры
